Пансион83/src/Catalogs/КвотаНомеров/КвотаНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КвотаНомеров</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>SortCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Договора</types>
    </type>
  </attributes>
  <attributes>
    <name>RoomRateType</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>RoomRate</name>
    <type>
      <types>CatalogRef.Тарифы</types>
    </type>
  </attributes>
  <attributes>
    <name>RoomRateServiceGroup</name>
    <type>
      <types>CatalogRef.НаборыУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ReleaseTime</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DoWriteOff</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsConfirmedBlock</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoCharge</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsQuotaForRooms</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsForCheckInPeriods</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OverbookingIsNotAllowed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerOrContractChangeIsNotAllowed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Color</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PeriodFrom</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PeriodTo</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BaseRoomQuota</name>
    <type>
      <types>CatalogRef.КвотаНомеров</types>
    </type>
  </attributes>
  <attributes>
    <name>RoomQuotaForCheckInPeriodTails</name>
    <type>
      <types>CatalogRef.КвотаНомеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Фирма</name>
    <type>
      <types>CatalogRef.Фирмы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>RoomTypes</name>
    <attributes>
      <name>Гостиница</name>
      <type>
        <types>CatalogRef.Гостиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>RoomType</name>
      <type>
        <types>CatalogRef.ТипыНомеров</types>
      </type>
    </attributes>
    <attributes>
      <name>PeriodFrom</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PeriodTo</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RoomQuantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SetRoomQuota</name>
      <type>
        <types>DocumentRef.СоставКвоты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CheckInPeriods</name>
    <attributes>
      <name>PeriodFrom</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PeriodTo</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SecondDuration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Пансион83/src/Catalogs/КвотаНомеров/ObjectModule.bsl
//-----------------------------------------------------------------------------
Процедура pmFillAttributesWithDefaultValues() Экспорт
	Гостиница = ПараметрыСеанса.ТекущаяГостиница;
	DoWriteOff = True;
КонецПроцедуры //pmFillAttributesWithDefaultValues

//-----------------------------------------------------------------------------
Function pmGetIntersectingCheckInPeriods(pPeriodFrom, pPeriodTo, pHotel = Неопределено) Экспорт
	// Try to find intersecting periods 
	vQry = New Query();
	vQry.Text = 
	"SELECT
	|	AllotmentCheckInPeriods.Гостиница,
	|	AllotmentCheckInPeriods.Тариф,
	|	AllotmentCheckInPeriods.КвотаНомеров,
	|	AllotmentCheckInPeriods.CheckInDate,
	|	AllotmentCheckInPeriods.Продолжительность,
	|	AllotmentCheckInPeriods.ДатаВыезда
	|FROM
	|	InformationRegister.RoomQuotaCheckInPeriods AS AllotmentCheckInPeriods
	|WHERE
	|	AllotmentCheckInPeriods.Гостиница = &qHotel
	|	AND AllotmentCheckInPeriods.КвотаНомеров = &qRoomQuota
	|	AND AllotmentCheckInPeriods.CheckInDate < &qCheckOutDate
	|	AND AllotmentCheckInPeriods.ДатаВыезда > &qCheckInDate
	|	AND NOT AllotmentCheckInPeriods.IsNotActive
	|
	|ORDER BY
	|	AllotmentCheckInPeriods.CheckInDate,
	|	AllotmentCheckInPeriods.Продолжительность";
	vQry.SetParameter("qHotel", ?(ЗначениеЗаполнено(pHotel), pHotel, Гостиница));
	vQry.SetParameter("qRoomQuota", Ref);
	
	vPeriods = vQry.Execute().Unload();
	Return vPeriods;
EndFunction //pmGetIntersectingCheckInPeriods

//-----------------------------------------------------------------------------
Function pmGetAllotmentDocuments() Экспорт
	// Try to find intersecting periods 
	vQry = New Query();
	vQry.Text = 
	"SELECT
	|	СоставКвоты.Ref
	|FROM
	|	Document.СоставКвоты AS СоставКвоты
	|WHERE
	|	СоставКвоты.Posted
	|	AND СоставКвоты.КвотаНомеров = &qRoomQuota
	|
	|ORDER BY
	|	СоставКвоты.PointInTime";
	vQry.SetParameter("qRoomQuota", Ref);
	vDocs = vQry.Execute().Unload();
	Return vDocs;
EndFunction //pmGetAllotmentDocuments

//-----------------------------------------------------------------------------
Процедура OnCopy(pCopiedObject)
	// Clear set ГруппаНомеров quota documents
	For Each vRow In RoomTypes Do
		vRow.SetRoomQuota = Documents.СоставКвоты.EmptyRef();
	EndDo;
КонецПроцедуры //OnCopy
